
CREATE DATABASE spl2024db 
 CHARACTER SET utf8mb4 COLLATE utf8mb4_bin;

CREATE TABLE tbl_user(
 uid VARCHAR(16) PRIMARY KEY,
 uname VARCHAR(32) NOT NULL,
 upass VARCHAR(32) NOT NULL,
 urole INT NOT NULL
);

INSERT INTO tbl_user VALUES
('admin', '管理者',   '5678', 9),
('staff', '教員',     '3456', 2),
('s0001', '斎藤 唯人','1234', 1),
('s0002', '谷口 志穂','1234', 1),
('s0003', '吉村 琉翔','1234', 1),
('s0004', '永井 涼平','1234', 1),
('s0005', '内田 真之介','1234', 1),
('s0006', '村上 まゆみ','1234', 1),
('s0007', '古川 凛太朗','1234', 1),
('s0008', '安田 遙斗','1234', 1),
('s0009', '内田 結奈','1234', 1),
('s0010', '片山 玲音','1234', 1),
('s0011', '川口 耕平','1234', 1),
('s0012', '伊藤 亮平','1234', 1),
('s0013', '菊池 英寿','1234', 1),
('s0014', '横田 駿太','1234', 1),
('s0015', '増田 隼翔','1234', 1),
('s0016', '今井 隆一','1234', 1),
('s0017', '濱田 陽斗','1234', 1),
('s0018', '阿部 絢','1234', 1),
('s0019', '柴田 智貴','1234', 1),
('s0020', '望月 陽菜子','1234', 1);